//** @file
//   Strings for Console Redirection Config DXE
//
//;******************************************************************************
//;* Copyright (c) 2023, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************

/=#

#include "Standard.uni"
#string STR_EFI_SETUP_UTILITY_TITLE     #language en-US        "InsydeH2O Setup Utility"
                                        #language fr-FR        "Logiciel de Configuration d'InsydeH2O"
                                        #language zh-TW        "\wide系微\narrow H2O \wide設定工具\narrow"
                                        #language zh-CN        "\wide菜单设定工具\narrow"
                                        #language ja-JP        "InsydeH2O \wideセットアップユーティリティ\narrow"
                                        #language it-IT        "Configuratore InsydeH2O"
                                        #language es-ES        "Utilitario de la programación de InsydeH2O"
                                        #language de-DE        "InsydeH2O-Anbringung"
                                        #language pt-PT        "Configura Utilidade do InsydeH2O"
#string STR_BLANK_STRING                #language en-US        " "
                                        #language fr-FR        " "
                                        #language zh-TW        " "
                                        #language ja-JP        " "
                                        #language it-IT        " "
                                        #language es-ES        " "
                                        #language de-DE        " "
                                        #language pt-PT        " "
#string STR_YES_TEXT                    #language en-US        "Yes"
                                        #language fr-FR        "Oui"
                                        #language zh-TW        "\wide是\narrow"
                                        #language zh-CN        "\wide确定\narrow"
                                        #language ja-JP        "\wideはい\narrow"
                                        #language it-IT        "Si"
                                        #language es-ES        "Sí"
                                        #language de-DE        "Ja"
                                        #language pt-PT        "Sim"
#string STR_NO_TEXT                     #language en-US        "No"
                                        #language fr-FR        "Non"
                                        #language zh-TW        "\wide否\narrow"
                                        #language zh-CN        "\wide取消\narrow"
                                        #language ja-JP        "\wideいいえ\narrow"
                                        #language it-IT        "No"
                                        #language es-ES        "Sí"
                                        #language de-DE        "Nein"
                                        #language pt-PT        "Não"
#string STR_DISABLED_TEXT               #language en-US        "Disabled"
                                        #language zh-CN        "\wide停用\narrow"
                                        #language fr-FR        "Désactiver"
                                        #language zh-TW        "\wide停用\narrow"
                                        #language ja-JP        "\wide無効\narrow"
                                        #language it-IT        "Disabilitato"
                                        #language es-ES        "inhabilitado"
                                        #language de-DE        "Sperren"
                                        #language pt-PT        "Proibir"
#string STR_ENABLED_TEXT                #language en-US        "Enabled"
                                        #language zh-CN        "\wide启用\narrow"
                                        #language fr-FR        "Activer"
                                        #language zh-TW        "\wide啟用\narrow"
                                        #language ja-JP        "\wide有効\narrow"
                                        #language it-IT        "abilitato"
                                        #language es-ES        "permitido"
                                        #language de-DE        "Aktivieren"
                                        #language pt-PT        "Permitir"
#string STR_AUTO_TEXT                   #language en-US        "Auto"
                                        #language zh-CN        "\wide自动\narrow"
                                        #language fr-FR        "Automatique"
                                        #language zh-TW        "\wide自動\narrow"
                                        #language ja-JP        "\wide自動\narrow"
                                        #language it-IT        "Auto"
                                        #language es-ES        "Auto"
                                        #language de-DE        "Automatisch"
                                        #language pt-PT        "Auto"                                   

#string STR_CR_CONSOLE_REDIRECTION      #language en-US        "Console Serial Redirect"
                                        #language ja-JP        "\wideコンソールシリアルリダイレクション\narrow"
                                        #language zh-CN        "\wide串口重定向\narrow"
#string STR_CR_CONSOLE_REDIRECTION_HELP #language en-US        "Enable or disable the serial console redirection function."
                                        #language ja-JP        "\wideコンソールシリアルリダイレクション機能の有効/無効を選択します。\narrow" 
                                        #language zh-CN        "\wide启用或停用串口重定向功能。\narrow"

#string STR_CONSOLE_REDIRECTION_FORMSET_TITLE        #language en-US        "Console Redirection Configuration"
                                                     #language fr-FR        "Configuration de la redirection de console"
                                                     #language ja-JP        "\wideコンソールリダイレクション\narrow"
                                                     #language zh-CN        "\wide串口重定向配置\narrow"
                                        
#string STR_CONSOLE_REDIRECTION_FORMSET_HELP         #language en-US        "Console Redirection settings."
                                                     #language fr-FR        "Paramètres de redirection de console."
                                                     #language zh-CN        "\wide配置串口重定向。\narrow"
                                                     #language ja-JP        "\wideコンソールリダイレクション設定。\narrow"

#string STR_STR_CONSOLE_REDIRECTION_TITLE            #language en-US        "Console Redirection Configuration"
                                                     #language fr-FR        "Configuration de la redirection de console"
                                                     #language zh-CN        "\wide串口重定向配置\narrow"   
                                                     #language ja-JP        "\wideコンソールリダイレクション\narrow"
//
// STR_STR_CR_DEVICE_TITLE or STR_CR_DEVICE_XXX_TITLE will be updated by run time driver.
//
#string STR_STR_CR_DEVICE_TITLE                      #language en-US        "Console Redirection Device Setup"
                                                     #language fr-FR        "Console Redirection Device Setup"
                                                    
#string STR_CR_DEVICE_0_TITLE                        #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_1_TITLE                        #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_2_TITLE                        #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_3_TITLE                        #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_4_TITLE                        #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_5_TITLE                        #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_6_TITLE                        #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_7_TITLE                        #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_8_TITLE                        #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_9_TITLE                        #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_10_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_11_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_12_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_13_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_14_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_15_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_16_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_17_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_18_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_19_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_20_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_21_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_22_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_23_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_24_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_25_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_26_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_27_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_28_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_29_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_30_TITLE                       #language en-US        "Console Redirection Device Setup"
#string STR_CR_DEVICE_31_TITLE                       #language en-US        "Console Redirection Device Setup"
                                        
#string STR_CR_LOGO_WAIT_TIME           #language en-US        "Information Wait Time"
                                        #language zh-CN        "\wide信息驻留时间\narrow"
                                        #language ja-JP        "\wideファームウェア情報表示時間\narrow"
#string STR_CR_LOGO_WAIT_TIME_HELP      #language en-US        "Set Console Redirection port information display time."
                                        #language zh-CN        "\wide选择串口重定向端口的信息显示时间。\narrow"
                                        #language ja-JP        "\wideコンソールリダイレクションのポート情報の表示時間を設定します。\narrow"
#string STR_CR_LOGO_WAIT_0_SECOND       #language en-US        "0 Second"
                                        #language zh-CN        "0\wide秒\narrow"
                                        #language ja-JP        "0\wide秒\narrow"
#string STR_CR_LOGO_WAIT_2_SECOND       #language en-US        "2 Seconds"
                                        #language zh-CN        "2\wide秒\narrow"
                                        #language ja-JP        "2\wide秒\narrow"
#string STR_CR_LOGO_WAIT_5_SECOND       #language en-US        "5 Seconds"
                                        #language zh-CN        "5\wide秒\narrow"
                                        #language ja-JP        "5\wide秒\narrow"
#string STR_CR_LOGO_WAIT_10_SECOND      #language en-US        "10 Seconds"
                                        #language zh-CN        "10\wide秒\narrow"
                                        #language ja-JP        "10\wide秒\narrow"
#string STR_CR_LOGO_WAIT_30_SECOND      #language en-US        "30 Seconds"
                                        #language zh-CN        "30\wide秒\narrow"
                                        #language ja-JP        "30\wide秒\narrow"
#string STR_CR_LOGO_WAIT_A_KEY          #language en-US        "Wait a Key"
                                        
#string STR_CR_TERMINAL_TYPE            #language en-US        "Terminal Type"
                                        #language zh-CN        "\wide终端类型\narrow"
                                        #language ja-JP        "\wide端末タイプ\narrow"
#string STR_CR_TERMINAL_TYPE_HELP       #language en-US        "Select the target terminal emulation type for console redirection."
                                        #language zh-CN        "\wide选择串口重定向的目标终端仿真类型。\narrow"
                                        #language ja-JP        "\wideコンソールリダイレクションに対する対象端末エミュレーションタイプを選択します。\narrow"

#string STR_CR_TERMINAL_TYPE_VT100      #language en-US        "VT_100"
#string STR_CR_TERMINAL_TYPE_VT100P     #language en-US        "VT_100+"
#string STR_CR_TERMINAL_TYPE_VTUTF8     #language en-US        "VT_UTF8"
#string STR_CR_TERMINAL_TYPE_ANSI       #language en-US        "PC_ANSI"
#string STR_CR_TERMINAL_TYPE_TTY        #language en-US        "TTY_TERM"
#string STR_CR_TERMINAL_TYPE_LINUX      #language en-US        "LINUX_TERM"
#string STR_CR_TERMINAL_TYPE_XTERM_R6   #language en-US        "XTERM_R6"
#string STR_CR_TERMINAL_TYPE_VT400      #language en-US        "VT_400"
#string STR_CR_TERMINAL_TYPE_SCO        #language en-US        "SCO_TERM"
#string STR_CR_TERMINAL_TYPE_LOG        #language en-US        "LOG_TERM"


#string STR_CR_AUTO_REFRESH             #language en-US        "Auto Refresh"
                                        #language zh-CN        "\wide自动刷新\narrow"
                                        #language ja-JP        "\wide自動更新\narrow"
#string STR_CR_AUTO_REFRESH_HELP        #language en-US        "When feature enable, screen will be auto refresh once after detect remote terminal was connected."
                                        #language zh-CN        "\wide当功能启用时，屏幕会在检测到远程终端连接后自动刷新一次。\narrow"
                                        #language ja-JP        "\wide機能を有効にすると、リモート端末の検出が接続された後、画面が1回自動更新されます。\narrow"

#string STR_CR_FAIL_SAFE_BAUDRATE       #language en-US        "FailSafeBaudRate"
#string STR_CR_FAIL_SAFE_BAUDRATE_HELP  #language en-US        "This feature will auto detect remote terminal baud rate and connect C.R serial device with detected baud rate"

#string STR_CR_PORT_ENABLE              #language en-US        "PortEnable"
                                        #language zh-CN        "\wide端口\narrow"
                                        #language ja-JP        "\wideポート\narrow"
#string STR_CR_PORT_ENABLE_HELP         #language en-US        "Enable or disable the COM_A port."
                                        #language zh-CN        "\wide启用或停用\narrow COM_A\wide端口。\narrow"
                                        #language ja-JP        "COM_A\wideポートを有効または無効にします。\narrow"

#string STR_CR_AFTER_POST               #language en-US        "C.R. After Legacy Boot"
                                        #language zh-CN        "\wide旧启动后的\narrow C.R."
                                        #language ja-JP        "\wideレガシーブート後の\narrowC.R."
#string STR_CR_AFTER_POST_HELP          #language en-US        "Console Redirection continue works after Legacy Boot."
                                        #language zh-CN        "\wide传统引导后控制台重定向继续工作。\narrow"
                                        #language ja-JP        "\wideコンソールリダイレクトは、レガシーブート後も機能し続けます。\narrow"

#string STR_CR_TEXT_MODE_RES            #language en-US        "Text Mode Resolution"
                                        #language zh-CN        "\wide文本模式分辨率\narrow"
                                        #language ja-JP        "\wideテキストモードの解像度\narrow"
#string STR_CR_TEXT_MODE_RES_HELP       #language en-US        "Console Redirection Text Mode Resolution. Changing this setting will affect the VGA resolution.\n\nAuto:\nFollow VGA text mode.\n\nForce 80x25:\nDon't care VGA, force text mode be 80x25 (VGA 640x480).\n\nForce 80x24 (DEL FIRST ROW):\nDon't care VGA, force text mode be 80x24, Del First Row.\n\nForce 80x24 (DEL LAST ROW):\nDon't care VGA, force text mode be 80x24, Del Last Row.\n\nLimit 128x40:\nLimit the VGA max text mode on 128x40 (VGA 1024x768)."
                                        #language zh-CN        "\wide控制台重定向文本模式解析。 更改此设置将影响 VGA 分辨率。\n\n自动：\n遵循 VGA 文本模式。\n\n强制 80x25：\n不管 VGA，强制文本模式为 80x25 (VGA 640x480)。\n\n强制 80x24 (DEL) FIRST ROW):\n不关心 VGA，强制文本模式为 80x24，Del First Row。\n\n强制 80x24（DEL LAST ROW）：\n不关心 VGA，强制文本模式为 80x24，Del Last Row。\n\n限制 128x40：\n限制 VGA 最大文本模式为 128x40 (VGA 1024x768)。\narrow"
                                        #language ja-JP        "\wideコンソールリダイレクトテキストモードの解像度。 この設定を変更すると、VGA解像度に影響します。\n \n自動：\nVGAテキストモードに従います。\n \n80x25を強制します：\nVGAを気にせず、テキストモードを80x25（VGA 640x480）に強制します。\n \n80x24（DEL）を強制します。 最初の行）：\nVGAを気にせず、テキストモードを80x24、デルの最初の行に強制します。\n \n80x24を強制します（最後の行を削除）：\nVGAを気にせず、テキストモードを80x24、デルの最後の行に強制します。\n \n128x40を制限します：\n128x40（VGA 1024x768）でVGA最大テキストモードを制限します。\narrow"

#string STR_CR_TEXT_MODE_AUTO           #language en-US        "AUTO"
#string STR_CR_TEXT_MODE_80X25          #language en-US        "Force 80x25"
#string STR_CR_TEXT_MODE_80X24_DF       #language en-US        "Force 80x24 (DEL FIRST ROW)"
#string STR_CR_TEXT_MODE_80X24_DL       #language en-US        "Force 80x24 (DEL LAST ROW)"
#string STR_CR_TEXT_MODE_128X40         #language en-US        "Limit 128x40"

#string STR_SPCR_SUPPORT_STRING         #language en-US        "ACPI SPCR Table"
#string STR_SPCR_SUPPORT_HELP           #language en-US        "Serial Port Console Redirection Table : Enabled this feature, the SPCR table will be add-into ACPI Tables."

#string STR_CR_USE_GLOBAL_SETTING          #language en-US        "UseGlobalSetting"
                                           #language zh-CN        "\wide使用全局设置\narrow" 
                                           #language ja-JP        "\wideグローバル設定を使用する\narrow"       
#string STR_CR_CR_USE_GLOBAL_SETTING_HELP  #language en-US        "Enable: C.R. will use global setting for this serial port.\nDisable: C.R. will use local setting for this serial port."
                                           #language zh-CN        "\wide启用或停用\narrow COM_A\wide端口。\narrow" 
                                           #language ja-JP        "COM_A\wideポートを有効または無効にします。\narrow"

#string STR_CR_SERIAL_PORT              #language en-US        "Serial Port"

#string STR_CR_SERIAL_PORT_HELP         #language en-US        "Set Console Redirection port"

#string STR_CR_SERIAL_PORTA             #language en-US        "COM_A"
#string STR_CR_SERIAL_PORTB             #language en-US        "COM_B"
#string STR_CR_SERIAL_PORTC             #language en-US        "COM_C"
#string STR_CR_SERIAL_PORTD             #language en-US        "COM_D"

#string STR_CR_PCI_ONLY                 #language en-US        "PCI Device"

#string STR_CR_SERIAL_ALL               #language en-US        "All Device Ports"

#string STR_CR_BAUD_RATE                #language en-US        "Baud Rate"
                                        #language zh-CN        "\wide波特率\narrow"
                                        #language ja-JP        "\wideボーレート\narrow"
#string STR_CR_BAUD_RATE_HELP           #language en-US        "Select the baud rate for console redirection."
                                        #language zh-CN        "\wide选择串口重定向的波特率。\narrow"
                                        #language ja-JP        "\wideコンソールリダイレクションのボーレートを選択します。\narrow"

#string STR_CR_BAUD_RATE_115200         #language en-US        "115200"
#string STR_CR_BAUD_RATE_57600          #language en-US        "57600"
#string STR_CR_BAUD_RATE_38400          #language en-US        "38400"
#string STR_CR_BAUD_RATE_19200          #language en-US        "19200"
#string STR_CR_BAUD_RATE_9600           #language en-US        "9600"
#string STR_CR_BAUD_RATE_4800           #language en-US        "4800"
#string STR_CR_BAUD_RATE_2400           #language en-US        "2400"
#string STR_CR_BAUD_RATE_1200           #language en-US        "1200"
#string STR_CR_BAUD_RATE_300            #language en-US        "300"

#string STR_CR_DATA_BIT                 #language en-US        "Data Bits" 
                                        #language zh-CN        "\wide数据位\narrow"    
                                        #language ja-JP        "\wideデータビット\narrow"
#string STR_CR_DATA_BIT_HELP            #language en-US        "Select the data transmission size for console redirection."
                                        #language zh-CN        "\wide选择串口重定向的数据传输大小。\narrow"    
                                        #language ja-JP        "\wideシリアルポートリダイレクトのデータ転送サイズを選択します。\narrow"

#string STR_CR_DATA_BIT_7               #language en-US        "7 Bits" 
                                        #language ja-JP        "7\wideビット\narrow"
                                        #language zh-CN        "7\wide位\narrow"
#string STR_CR_DATA_BIT_8               #language en-US        "8 Bits"
                                        #language ja-JP        "8\wideビット\narrow"
                                        #language zh-CN        "8\wide位\narrow"

#string STR_CR_STOP_BIT                 #language en-US        "Stop Bits"
                                        #language zh-CN        "\wide停止位\narrow"
                                        #language ja-JP        "\wide停止ビット\narrow"
#string STR_CR_STOP_BIT_HELP            #language en-US        "Select a stop bit to indicate the end of a serial data packet."
                                        #language zh-CN        "\wide选择停止位以指示串行数据包的结束。\narrow"
                                        #language ja-JP        "\wideシリアルデータパケットの終端を示す停止ビットを選択します。\narrow"

#string STR_CR_STOP_BIT_1               #language en-US        "1 Bit"
                                        #language ja-JP        "1\wideビット\narrow"
                                        #language zh-CN        "1\wide位\narrow"
#string STR_CR_STOP_BIT_2               #language en-US        "2 Bits"
                                        #language ja-JP        "2\wideビット\narrow"
                                        #language zh-CN        "2\wide位\narrow"
 
#string STR_CR_PARITY                   #language en-US        "Parity"
                                        #language zh-CN        "\wide校验位\narrow"
                                        #language ja-JP        "\wideパリティ\narrow"
#string STR_CR_PARITY_HELP              #language en-US        "Select an option for sending parity bits with regular data bits to detect data transmission errors."
                                        #language zh-CN        "\wide选择用于发送具有常规数据位的奇偶校验位的选项，以检测数据传输错误。\narrow"
                                        #language ja-JP        "\wideデータ送信エラーを検出するために、通常のデータビットでパリティビットを送信するオプションを選択します。\narrow"
#string STR_CR_PARITY_NONE              #language en-US        "None"
                                        #language zh-CN        "\wide无校验\narrow"
                                        #language ja-JP        "\wideなし\narrow"
#string STR_CR_PARITY_EVEN              #language en-US        "Even" 
                                        #language zh-CN        "\wide偶校验\narrow"
                                        #language ja-JP        "\wide偶数\narrow"
#string STR_CR_PARITY_ODD               #language en-US        "Odd"
                                        #language zh-CN        "\wide奇校验\narrow"
                                        #language ja-JP        "\wide奇数\narrow"
#string STR_CR_PARITY_MARK              #language en-US        "Mark"
                                        #language zh-CN        "\wide标记校验\narrow"
                                        #language ja-JP        "\wideマーク\narrow"
#string STR_CR_PARITY_SPACE             #language en-US        "Space"
                                        #language zh-CN        "\wide空校验\narrow"
                                        #language ja-JP        "\wideスペース\narrow"

#string STR_CR_FLOW_CONTROL             #language en-US        "Flow Control"
                                        #language zh-CN        "\wide流控\narrow"
                                        #language ja-JP        "\wideフロー制御\narrow"
#string STR_CR_FLOW_CONTROL_HELP        #language en-US        "Select the flow control for console redirection."
                                        #language zh-CN        "\wide选择串口重定向的流量控制。\narrow"
                                        #language ja-JP        "\wideコンソールリダイレクションのフロー制御を選択します。\narrow" 

#string STR_CR_FLOW_CONTROL_NONE        #language en-US        "None"
#string STR_CR_FLOW_CONTROL_HARDWARE    #language en-US        "RTS/CTS"
#string STR_CR_FLOW_CONTROL_SOFTWARE    #language en-US        "XON/XOFF"

#string STR_NAME_VALUE_VAR_NAME0        #language en-US        "CrNameValue"
													 
#string STR_CR_TERMINAL_RESIZE          #language en-US        "Auto adjust Terminal resolution"
                                        #language zh-CN        "\wide自动调整终端分辨率\narrow"
                                        #language ja-JP        "\wideターミナル解像度の自動調整\narrow"
#string STR_CR_TERMINAL_RESIZE_HELP     #language en-US        "Through send extra ESC sequencs code to adjust terminal resolution to fit host screen. \n\nSupporting terminals:\n1.PuTTY:\nPlease uncheck the \"Disable remote-controlled terminal resizing\" in Terminal->Features setting.\n\n2.Tera Term:\nPlease check the \"Term Size = win size\" in Setup->Terminal."
                                        #language zh-CN        "\wide通过发送额外的 ESC 序列代码来调整终端分辨率以适应主机屏幕。 \n\n支持终端：\n1.PuTTY：\n请在终端->功能设置中取消勾选[禁用远程控制终端调整大小]。\n\n2.Tera Term：\n在设置->终端，请勾选[Term Size = win size]。\narrow"
                                        #language ja-JP        "\wide追加のESCシーケンスコードを送信して、ホスト画面に合うように端末の解像度を調整します。 \n \nサポート端末：\n1.PuTTY：\n [端末]->[機能]設定で[リモート制御端末のサイズ変更を無効にする]のチェックを外してください。\n \n2。TeraTerm：\n [Term Size = win size]を確認してください Setup-> Terminal。\narrow"

